In [2]:
import pandas as pd
import numpy as np

In [3]:
prod = pd.read_csv("https://www.wolframcloud.com/obj/mar/Hamoye/Session%202/Data/Africa%20Food%20Production%20(2004%20-%202013).csv",
                   error_bad_lines = False
                  )

supply = pd.read_csv("https://www.wolframcloud.com/obj/mar/Hamoye/Session%202/Data/Africa%20Food%20Supply%20(2004%20-%202013).csv",
                     error_bad_lines = False
                    )

In [4]:
supply.head()

   Country  Year  Value
0  Algeria  2004   2987
1  Algeria  2005   2958
2  Algeria  2006   3047
3  Algeria  2007   3041
4  Algeria  2008   3048

In [5]:
prod.head()

   Country                Item  Year  Value
0  Algeria  Wheat and products  2004   2731
1  Algeria  Wheat and products  2005   2415
2  Algeria  Wheat and products  2006   2688
3  Algeria  Wheat and products  2007   2319
4  Algeria  Wheat and products  2008   1111

In [6]:
# Question 1: Which country produced the highest amount of oats in 2010?
temp = prod[(prod.Item == "Oats") & (prod.Year == 2010)].groupby('Country', 
                                                          as_index=False).Value.max()
temp = temp.sort_values(by='Value', ascending=False)
indx = pd.Index(np.arange(temp.shape[0]))
temp.set_index(indx, inplace=True)
temp.loc[0].to_frame()

               0
Country  Algeria
Value         88

In [7]:
# Question 2: Which three countries respectively had the lowest food supply 
# between 2004 and 2006 (inclusive)?
bool_series = [year in [2004,2005,2006] for year in supply.Year]
temp = supply.loc[bool_series].groupby('Country', as_index=False).Value.sum()
temp = temp.sort_values(by='Value')
indx = pd.Index(np.arange(temp.shape[0]))
temp.set_index(indx, inplace=True)
temp.iloc[:3]

                    Country  Value
0                    Zambia   5577
1                  Ethiopia   5827
2  Central African Republic   6044

In [8]:
# Question 5: What three countries have produced the highest total quantity 
# of rice from 2004 to 2013?

temp = prod[prod.Item.str.contains('Rice')].groupby('Country',as_index=False).Value.sum()
temp = temp.sort_values(by='Value', ascending=False)
indx = pd.Index(np.arange(temp.shape[0]))
temp.set_index(indx, inplace=True)
temp.iloc[:3]

      Country  Value
0       Egypt  40370
1     Nigeria  26964
2  Madagascar  26118

In [9]:
!ls

Africa_pop.xlsx        Untitled.ipynb            leg_example.png
EDA_africa_food.ipynb  africa_percapitaGDP.xlsx

In [ ]:
!mv Untitled.ipynb Stage_C_quiz_code.